// const hex =
//   "0791973189968927400ED0C2303BEC1E971B0008525040518261828C05000364040104110430043B0430043D0441003A00340034002C003700380440000A000A002F002F00200421043F0435044604380430043B044C043D043E00200434043B044F002004320430044100200033003000200413043100200438043D044204350440043D0435044204300020043800200032003000300020043C0438043D04430442002004410020";

// // Buffer.from(hex, 'hex') создаёт буфер байт в порядке big‑endian.
// // Node.js по умолчанию при кодировке 'ucs2' понимает little‑endian,
// // поэтому нужно переставить байты попарно:
// const buf = Buffer.from(hex, "hex").swap16();

// // Теперь перекодируем в UCS‑2 (UTF‑16LE в терминологии Node):
// const text = buf.toString("ucs2");
// console.log(text);
